# **데이터프레임 결합**

## **1.환경준비**

* 라이브러리 불러오기

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

* 데이터 가져오기

In [8]:
sales = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_sales_simple.csv")

sales1 = sales.loc[sales['Store_ID']==1]
sales2 = sales.loc[sales['Store_ID']==2]
sales5 = sales.loc[sales['Store_ID']==5]
sales11 = sales.loc[sales['Store_ID']==11]

products = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_product_master.csv")
stores = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_store_master.csv")

In [9]:
sales1.head()

   Order_ID        Date  Store_ID  Qty  Product_ID
0         3  2013-01-01         1  0.0           3
1         5  2013-01-01         1  0.0           5
2         7  2013-01-01         1  0.0           7
3         8  2013-01-01         1  0.0           8
4        10  2013-01-01         1  0.0          10

In [12]:
products.head()

   Product_ID Product_Code      SubCategory         Category  LeadTime  Price
0          20        HG001  Gardening Tools  Household Goods         2     50
1          27        HH001  Home Appliances  Household Goods         2    150
2          16        HK001          Kitchen  Household Goods         2     23
3          15        HK002          Kitchen  Household Goods         2     41
4          32        GS001          Seafood          Grocery         3     34

In [14]:
stores.head()

   Store_ID           City      State  Store_Type
0         1     Saint Paul  Minnesota           4
1         2     Saint Paul  Minnesota           4
2         3     Saint Paul  Minnesota           4
3         4     Saint Paul  Minnesota           4
4         5  Oklahoma City   Oklahoma           4

## **2.결합1 : 붙이기 concat()**

* 데이터를 생성해 봅시다.

In [16]:
df1 = pd.DataFrame({'A':[10,25], 'B':[15,30]})
df2 = pd.DataFrame({'A':[20,30, 50], 'C':[35,30, 40]})
df2.drop([1], inplace = True)

display(df1)
display(df2)

    A   B
0  10  15
1  25  30

    A   C
0  20  35
2  50  40

### **(1) 세로로 합치기 : axis = 0**

* join = 'inner'

In [18]:
pd.concat([df1, df2], axis = 0, join = 'inner')

    A
0  10
1  25
0  20
2  50

* join = 'outer'

In [20]:
pd.concat([df1, df2], axis = 0, join = 'outer')

    A     B     C
0  10  15.0   NaN
1  25  30.0   NaN
0  20   NaN  35.0
2  50   NaN  40.0

### **(2) 가로로 합치기 : axis = 1**

* join = 'inner'

In [22]:
pd.concat([df1, df2], axis = 1, join = 'inner')

    A   B   A   C
0  10  15  20  35

* join = 'outer'

In [24]:
pd.concat([df1, df2], axis = 1, join = 'outer')

      A     B     A     C
0  10.0  15.0  20.0  35.0
1  25.0  30.0   NaN   NaN
2   NaN   NaN  50.0  40.0

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] sales1,2,5,11 데이터프레임을 하나로 합칩시다. 어떻게 합치는게 좋을까요?

In [82]:
temp=pd.concat([sales1,sales2,sales5,sales11],axis=0)
temp

       Order_ID        Date  Store_ID      Qty  Product_ID
0             3  2013-01-01         1    0.000           3
1             5  2013-01-01         1    0.000           5
2             7  2013-01-01         1    0.000           7
3             8  2013-01-01         1    0.000           8
4            10  2013-01-01         1    0.000          10
...         ...         ...       ...      ...         ...
24340     53548  2013-01-31        11   10.000          22
24341     53550  2013-01-31        11  641.507          24
24342     53553  2013-01-31        11    0.000          27
24343     53555  2013-01-31        11   27.000          29
24344     53558  2013-01-31        11   13.000          32

[1860 rows x 5 columns]

[문2] (조금 어려운 문제!)  
일별, 매장별 판매량 합계를 구해 봅시다.  
groupby, pd.concat 을 이용하여 다음과 같은 결과를 얻도록 코드를 작성해봅시다.

* 힌트
    * 1) sales1, 2, 5,11 로 부터 각각 일별 판매량 합계 집계하기
        * 집계시 .agg() 를 이용하여 열이름 변경하거나, 집계후 열이름 변경하기
    * 2) pd.concat 으로 가로로 합치기

In [39]:
list(sales1)

['Order_ID', 'Date', 'Store_ID', 'Qty', 'Product_ID']

In [ ]:
#내 방법

In [53]:
sales1_sum=sales1.groupby('Date','Stored_ID',as_index=False)[['Qty']].sum()

In [55]:
sales2_sum=sales2.groupby('Date','Stored_ID',as_index=False)[['Qty']].sum()

In [57]:
sales5_sum=sales5.groupby('Date','Stored_ID',as_index=False)[['Qty']].sum()

In [59]:
sales11_sum=sales11.groupby('Date','Stored_ID',as_index=False)[['Qty']].sum()

In [70]:
pd.concat([sales1_sum,sales2_sum,sales5_sum,sales11_sum],axis=1,join='outer')

,Date,Qty,Date,Qty,Date,Qty,Date,Qty
0,2013-01-01,0.000000,2013-01-01,0.000000,2013-01-01,0.000000,2013-01-01,0.000000
1,2013-01-02,6760.782000,2013-01-02,9221.338001,2013-01-02,9404.229020,2013-01-02,16593.312000
2,2013-01-03,5348.384001,2013-01-03,6830.089000,2013-01-03,6932.685000,2013-01-03,11032.676040
3,2013-01-04,5390.445001,2013-01-04,6742.984000,2013-01-04,6567.938000,2013-01-04,10962.687002
4,2013-01-05,5787.839000,2013-01-05,8583.055000,2013-01-05,7276.800000,2013-01-05,13315.896000
5,2013-01-06,2007.194000,2013-01-06,9317.139000,2013-01-06,9578.077030,2013-01-06,14165.615050
6,2013-01-07,5639.396000,2013-01-07,6047.629000,2013-01-07,5729.203000,2013-01-07,9946.420000
7,2013-01-08,5131.128000,2013-01-08,5545.928020,2013-01-08,5716.248000,2013-01-08,9258.956000
8,2013-01-09,6198.154980,2013-01-09,6061.471020,2013-01-09,5352.507000,2013-01-09,8644.922000
9,2013-01-10,4309.750000,2013-01-10,5070.431000,2013-01-10,5319.121020,2013-01-10,8470.169000
10,2013-01-11,5053.745980,2013-01-11,5822.891982,2013-01-11,5786.585000,2013-01-11,7316.129000
11,2013-01-12,5073.569980,2013-01-12,7479.722000,2013-01-12,6246.480000,2013-01-12,10959.593000
12,2013-01-13,2482.635000,2013-01-13,9059.072000,2013-01-13,8299.981000,2013-01-13,10857.623960
13,2013-01-14,5192.406000,2013-01-14,5404.198000,2013-01-14,5398.938000,2013-01-14,7789.259030
14,2013-01-15,4774.043000,2013-01-15,5255.754000,2013-01-15,5528.819000,2013-01-15,8215.977970
15,2013-01-16,6210.563002,2013-01-16,6543.510000,2013-01-16,6147.083980,2013-01-16,7540.355000
16,2013-01-17,4544.486000,2013-01-17,5214.799020,2013-01-17,5109.820000,2013-01-17,7395.201000
17,2013-01-18,5419.165001,2013-01-18,6668.457000,2013-01-18,5043.555000,2013-01-18,7918.020000
18,2013-01-19,5447.259000,2013-01-19,8016.393000,2013-01-19,6228.933000,2013-01-19,11044.523000
19,2013-01-20,2153.939995,2013-01-20,8932.121020,2013-01-20,8204.085000,2013-01-20,11211.312000
20,2013-01-21,4784.614020,2013-01-21,6380.861000,2013-01-21,5511.559999,2013-01-21,9088.764040
21,2013-01-22,4922.417000,2013-01-22,5658.953001,2013-01-22,5426.481000,2013-01-22,7967.939000
22,2013-01-23,5770.343000,2013-01-23,6056.067000,2013-01-23,5624.662000,2013-01-23,7246.130000
23,2013-01-24,4559.193000,2013-01-24,4608.736000,2013-01-24,5053.194000,2013-01-24,7802.938000
24,2013-01-25,5144.064000,2013-01-25,6096.080000,2013-01-25,5591.837000,2013-01-25,7977.591980
25,2013-01-26,4820.926000,2013-01-26,7550.064982,2013-01-26,6232.117000,2013-01-26,10446.452000
26,2013-01-27,2242.990000,2013-01-27,8169.363000,2013-01-27,6562.350000,2013-01-27,10590.136000
27,2013-01-28,4484.428000,2013-01-28,5111.355000,2013-01-28,5595.128020,2013-01-28,8419.120000
28,2013-01-29,4285.201001,2013-01-29,5210.258000,2013-01-29,4720.338000,2013-01-29,6970.078000
29,2013-01-30,5634.577000,2013-01-30,5956.379000,2013-01-30,5071.153000,2013-01-30,7744.136020
30,2013-01-31,4341.563000,2013-01-31,4862.804996,2013-01-31,5230.479000,2013-01-31,8367.902000

## **3.결합 ① : 조인 join(merge)**

* 판다스에서 join은 굉장히 간단합니다.
* 자동으로 key를 잡아줍니다
* default로 inner join을 합니다.

In [88]:
df1 = pd.DataFrame({'A':[1,2], 'B':[15,30], 'C':[20, 25]})
df2 = pd.DataFrame({'A':[2,3], 'D':[20, 35]})

display(df1)
display(df2)

   A   B   C
0  1  15  20
1  2  30  25

   A   D
0  2  20
1  3  35

### **(1) inner merge**

In [90]:
pd.merge(df1, df2, how = 'inner', on = 'A')

   A   B   C   D
0  2  30  25  20

In [92]:
pd.merge(df1, df2, how = 'inner')

   A   B   C   D
0  2  30  25  20

In [94]:
pd.merge(df1,df2)

   A   B   C   D
0  2  30  25  20

### **(2) left merge**

In [96]:
pd.merge(df1, df2, how = 'left')

   A   B   C     D
0  1  15  20   NaN
1  2  30  25  20.0

### **(3) right merge**

In [98]:
pd.merge(df1, df2, how = 'right')

   A     B     C   D
0  2  30.0  25.0  20
1  3   NaN   NaN  35

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] 일별, 매장별 판매량 합계를 구해 봅시다.  
groupby, pd.merge 을 이용하여 다음과 같은 결과를 얻도록 코드를 작성해봅시다.

* 힌트
    * 1) sales1, 2, 5,11 로 부터 각각 일별 판매량 합계 집계하기
        * 집계시 .agg() 를 이용하여 열이름 변경하거나, 집계후 열이름 변경하기
    * 2) pd.merge 으로 결합하기

문제 너무 꼬였음 패스!

In [100]:
temp = pd.concat([sales1, sales2, sales5, sales11], axis = 0)
temp

       Order_ID        Date  Store_ID      Qty  Product_ID
0             3  2013-01-01         1    0.000           3
1             5  2013-01-01         1    0.000           5
2             7  2013-01-01         1    0.000           7
3             8  2013-01-01         1    0.000           8
4            10  2013-01-01         1    0.000          10
...         ...         ...       ...      ...         ...
24340     53548  2013-01-31        11   10.000          22
24341     53550  2013-01-31        11  641.507          24
24342     53553  2013-01-31        11    0.000          27
24343     53555  2013-01-31        11   27.000          29
24344     53558  2013-01-31        11   13.000          32

[1860 rows x 5 columns]

[문2] 매장1에 대해서, 일별, 카테고리별 판매량 합계를 구해 봅시다.

In [107]:
list(sales1)

['Order_ID', 'Date', 'Store_ID', 'Qty', 'Product_ID']

In [111]:
sales1.head()

   Order_ID        Date  Store_ID  Qty  Product_ID
0         3  2013-01-01         1  0.0           3
1         5  2013-01-01         1  0.0           5
2         7  2013-01-01         1  0.0           7
3         8  2013-01-01         1  0.0           8
4        10  2013-01-01         1  0.0          10

In [114]:
products.sort_values('Product_ID')

,Product_ID,Product_Code,SubCategory,Category,LeadTime,Price
13,3,DB001,Beverage,Drink,2,8
10,5,FB001,BAKERY,Food,2,6
12,7,HC001,Cleaning,Household Goods,2,15
11,8,FM001,Milk,Food,2,4
8,10,GE001,EGGS,Grocery,2,5
7,11,FF001,Frozen,Food,2,29
14,12,GA001,Agricultural products,Grocery,3,6
3,15,HK002,Kitchen,Household Goods,2,41
2,16,HK001,Kitchen,Household Goods,2,23
0,20,HG001,Gardening Tools,Household Goods,2,50
5,22,DA001,Alcohol,Drink,2,12
9,24,GM001,Meats,Grocery,3,17
1,27,HH001,Home Appliances,Household Goods,2,150
6,29,FP001,Prepared,Food,2,18
4,32,GS001,Seafood,Grocery,3,34

In [120]:
t1=pd.merge(sales1,products,how='inner')
t1.groupby(['Date','Category'],as_index=False)['Qty'].sum()

           Date         Category       Qty
0    2013-01-01            Drink     0.000
1    2013-01-01             Food     0.000
2    2013-01-01          Grocery     0.000
3    2013-01-01  Household Goods     0.000
4    2013-01-02            Drink  1158.000
..          ...              ...       ...
119  2013-01-30  Household Goods   932.000
120  2013-01-31            Drink   971.000
121  2013-01-31             Food   751.766
122  2013-01-31          Grocery  1907.797
123  2013-01-31  Household Goods   711.000

[124 rows x 3 columns]

[문3] 도시별, 총판매량 합계를 구하시오.

In [124]:
sales

       Order_ID        Date  Store_ID      Qty  Product_ID
0             3  2013-01-01         1    0.000           3
1             5  2013-01-01         1    0.000           5
2             7  2013-01-01         1    0.000           7
3             8  2013-01-01         1    0.000           8
4            10  2013-01-01         1    0.000          10
...         ...         ...       ...      ...         ...
25105     55231  2013-01-31         9   47.000          22
25106     55233  2013-01-31         9  348.475          24
25107     55236  2013-01-31         9    0.000          27
25108     55238  2013-01-31         9   42.000          29
25109     55241  2013-01-31         9   24.986          32

[25110 rows x 5 columns]

In [122]:
stores.head()

   Store_ID           City      State  Store_Type
0         1     Saint Paul  Minnesota           4
1         2     Saint Paul  Minnesota           4
2         3     Saint Paul  Minnesota           4
3         4     Saint Paul  Minnesota           4
4         5  Oklahoma City   Oklahoma           4

In [128]:
t2=pd.merge(sales,stores)
t2.groupby('City',as_index=False)['Qty'].sum()

             City           Qty
0          Albany  1.119409e+05
1       Annapolis  2.255278e+05
2       Asheville  6.644511e+04
3         Atlanta  3.845901e+05
4     Bloomington  1.315413e+05
5          Boston  1.138053e+05
6       Charlotte  1.454050e+05
7        Columbus  1.872153e+05
8      Harrisburg  1.421269e+05
9    Indianapolis  1.488044e+05
10             LA  1.009753e+05
11    Minneapolis  2.852598e+05
12      Nashville  1.182960e+05
13  Oklahoma City  3.102069e+05
14        Olympia  1.205583e+05
15        Phoenix  4.475075e+05
16        Raleigh  1.095650e+06
17       Richmond  2.188491e+05
18     Sacramento  0.000000e+00
19     Saint Paul  4.989027e+06
20     Wilmington  0.000000e+00

### **(4) pivot**
* pivot : 결합은 아니지만, 집계 후 데이터프레임 구조를 변형해서 조회하는데 종종 사용 됩니다.

* 단계
    * 1) groupby
    * 2) pivot

In [1]:
# 1) 매장1의 일별 카테고리별 판매량을 집계

temp = pd.merge(sales1, products)
temp2 = temp.groupby(['Date', 'Category'], as_index = False)['Qty'].sum()
temp2

NameError: name 'pd' is not defined

In [ ]:
# 2) pivot
temp3 = temp2.pivot(index= 'Category', colums='Date' ,values='Qty')
temp3

In [ ]:
# sns.heatmap으로 시각화 할 수도 있습니다!

plt.figure(figsize = (20, 6))
sns.heatmap(temp3)
plt.show()

## **4.복습문제**

In [ ]:
# 라이브러리 불러오기
import pandas as pd

In [ ]:
sales = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_sales_simple.csv")
products = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_product_master.csv")
stores = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/ts_store_master.csv")

1) sales에 금액(Amt) 변수를 추가하시오.
* Amt = Qty * Price

2) City별 매출액

3) City별 카테고리별 매출액

4) 매출액이 가장 높은 주(state) top 3

추가 문제

* 2013년 1월 세째 주 각 도시별 subCategory별 금액 비교
    1. 2013년 1월 세째 주
        * sales['Date']를 날짜 타입으로 변환
        * week 추가
        * sales에서 week가 3인 데이터 뽑기
    2. 각 도시별 subCategory별
        * 1의 결과에서...
        * stores와 inner merge
        * products와 inner merge
    3. 도시별 subCategory별 금액
        * Qty * Price로 Amt 추가
        * groupby
    4. 좀더 보기 좋게! pivot + heatmap
        * pivot
        * heatmap

In [ ]:
temp2['Date'] = pd.to_datetime(temp2['Date'])
temp2['Year'] = temp2['Date'].dt.year
temp2['Month'] = temp2['Date'].dt.month
temp2['Week'] = temp2['Date'].dt.isocalendar().week
temp2.head()

temp5 = temp2.loc[(temp2['Year']==2013) & (temp2['Month']==1 ) & ( temp2['Week']==3)]
temp5.head(3)

In [ ]:
temp6 = temp5.groupby(['City','SubCategory'], as_index = False)['Amt'].sum()
temp6

In [ ]:
temp7 = temp6.pivot(index = 'SubCategory', columns = 'City', values = 'Amt')
temp7

In [ ]:
sns.heatmap(temp7)